In [1]:
import pandas as pd

In [2]:
data = {
  'Name': ['Alice', 'Bob', 'Charlie'],
  'Age': [25, 30, 22],
  'City': ['New York', 'Chicago', 'Miami']
} 

df = pd.DataFrame(data)

In [5]:
df.head()
# top rows of the data

      Name  Age      City
0    Alice   25  New York
1      Bob   30   Chicago
2  Charlie   22     Miami

In [6]:
df.tail()
# last rows of the data

      Name  Age      City
0    Alice   25  New York
1      Bob   30   Chicago
2  Charlie   22     Miami

In [7]:
# numbers of rows and columns
df.shape

(3, 3)

In [9]:
# number of non-null values
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [10]:
df.duplicated()

0    False
1    False
2    False
dtype: bool